/*Задача 2
Реалізувати програму на Javascript, яка буде знаходити всі числа кратні 5 (діляться на 5 без залишку) у заданому діапазоні.

- Висести за допомогою модального вікна браузера число, яке введе користувач.
- Вивести в консолі усі числа кратні 5, від 0 до введеного користувачем числа. Якщо таких чисел немає - вивести в консоль фразу Sorry, no numbers
- Обов'язково необхідно використовувати синтаксис ES6 (ES2015) для створення змінних.

- Перевірити, чи введене значення є цілим числом. Якщо ця умова не дотримується, повторювати виведення вікна на екран, доки не буде введено ціле число. */

let data_number = prompt("Введите ваше число:");


if (data_number % 1 == 0) {

    if (data_number == null || data_number == 0) {
        alert("Вы не ввели число или ввели 0!!!")
    }
    else if (data_number <= 4) {
        document.write("Sorry, no numbers")
    }

    else {
        for (let i = 0; i <= data_number; i++) {


            if (i % 5 == 0 && i != 0) {
                document.write("<br/>");
                document.write(i);

            }



        }
        
        document.write("<br/>" + "Вы ввели число " + data_number);
    }
}
else
    document.write("Вы ввели не целое число");
